In [1]:
import pandas as pd
import sqlite3
import sql

sql.style = 'plain'

%load_ext sql
connection=sqlite3.connect("leetcode_database.db")
print("Successfully connected to SQL database")


# Connect to SQLite
%sql sqlite:///leetcode_database.db
print("success")

Successfully connected to SQL database
success

In [4]:
%%sql
-- Drop tables if they already exist
DROP TABLE IF EXISTS EmployeeUNI;
DROP TABLE IF EXISTS Employees;

-- Create Employees table
CREATE TABLE Employees (
    id INT PRIMARY KEY,
    name VARCHAR(100)
);

-- Insert data into Employees
INSERT INTO Employees (id, name) VALUES
(1, 'Alice'),
(7, 'Bob'),
(11, 'Meir'),
(90, 'Winston'),
(3, 'Jonathan')

 * sqlite:///leetcode_database.db
Done.
Done.
Done.
5 rows affected.

[]

In [5]:
%%sql
-- Create EmployeeUNI table
CREATE TABLE EmployeeUNI (
    id INT PRIMARY KEY,
    unique_id INT
);

-- Insert data into EmployeeUNI
INSERT INTO EmployeeUNI (id, unique_id) VALUES
(3, 1),
(11, 2),
(90, 3);

 * sqlite:///leetcode_database.db
Done.
3 rows affected.

[]

In [9]:
%%sql
SELECT * FROM Employees

 * sqlite:///leetcode_database.db
Done.

[(1, 'Alice'), (7, 'Bob'), (11, 'Meir'), (90, 'Winston'), (3, 'Jonathan')]

In [10]:
%%sql
SELECT * FROM EmployeeUNI

 * sqlite:///leetcode_database.db
Done.

[(3, 1), (11, 2), (90, 3)]

###### PS : Write a solution to show the unique ID of each user, If a user does not have a unique ID , just replace it with null.

* for each user, mean we'll apply a LEFT JOIN
* All the rows from left and matching rows in the right + Null values for unmatched values

In [13]:
%%sql
SELECT e.name,eu.unique_id
FROM Employees e
LEFT JOIN EmployeeUNI eu
ON e.id=eu.id

 * sqlite:///leetcode_database.db
Done.

[('Alice', None), ('Bob', None), ('Meir', 2), ('Winston', 3), ('Jonathan', 1)]